app/views/networks/index.html.erb

SELECT "shows".* FROM "shows" WHERE "shows"."network_id" = ?  [["network_id", 1]]
---
    <li><%=link_to network.name, network_path(network)%>
      <ul><% network.shows.each do |show| %>