app/views/networks/show.html.erb

SELECT "shows".* FROM "shows" WHERE "shows"."network_id" = ?  [["network_id", 1]]
---
<ul>
  <%@network.shows.each do |show|%>