app/views/users/show.html.erb

SELECT  "user_shows".* FROM "user_shows" WHERE "user_shows"."user_id" = ? AND "user_shows"."id" = ? LIMIT 1  [["user_id", 4], ["id", 4]]
---
<ul>
  <%@user.user_shows.each do |show|%>