app/controllers/networks_controller.rb

SELECT "networks".* FROM "networks"
---
  def index
    @networks = Network.all

SELECT  "networks".* FROM "networks" WHERE "networks"."slug" = ? LIMIT 1  [["slug", "sftv"]]
---
  def show
    @network = Network.find_by(slug:params[:id])