app/controllers/shows_controller.rb

SELECT  "shows".* FROM "shows" WHERE "shows"."title" = ?  ORDER BY "shows"."id" ASC LIMIT 1  [["title", "What about this show?"]]
SELECT  "shows".* FROM "shows" INNER JOIN "user_shows" ON "shows"."id" = "user_shows"."show_id" WHERE "user_shows"."user_id" = ? AND "shows"."title" = ? LIMIT 1  [["user_id", 4], ["title", "What about this show?"]]
---
  def create
    @show = Show.where(title:show_params[:title]).first_or_create(show_params)
    if @show.save
      current_user.shows << @show if !current_user.shows.find_by(title:@show.title)