app/controllers/shows_controller.rb

SELECT "shows".* FROM "shows" WHERE ('t'='f')
---
  def index
    # binding.pry
    if params[:user_id]
        @user = User.find_by(slug: params[:user_id])
        if !@user.nil?
          @shows = @user.shows
          render_shows_format
        else
          flash[:error] = "That user does not exist."
          @shows = Show.all

SELECT  "shows".* FROM "shows" WHERE "shows"."slug" = ? LIMIT 1  [["slug", "a-great-show"]]
---
  def show
      @show = Show.find_by(slug:params[:id])

SELECT  "networks".* FROM "networks"  ORDER BY "networks"."id" ASC LIMIT 1
---
  def new
    @show = Show.new
    @network = Network.new
    @networks = Network.all

SELECT  "shows".* FROM "shows" WHERE "shows"."slug" = ? LIMIT 1  [["slug", "jason-s-show"]]
---
  def edit
    @show = Show.find_by(slug:params[:id])

INSERT INTO "shows" ("title", "day", "network_id", "time", "slug") VALUES (?, ?, ?, ?, ?)  [["title", "I wonder how this will go?"], ["day", "Monday"], ["network_id", 2], ["time", "{1=>2016, 2=>6, 3=>6, 4=>12, 5=>30}"], ["slug", "i-wonder-how-this-will-go"]]
SELECT  "networks".* FROM "networks" WHERE (SFTV) LIMIT 1
---
  def create
    if Show.find_by(remote_id: show_params[:remote_id])
      if Show.find_by(remote_id: show_params[:remote_id]).remote_id != nil
        @show = Show.find_by(remote_id: show_params[:remote_id])
      end
    else
      @show = Show.create(show_params)
    end
    if @show.save
      current_user.shows << @show
      @network = @show.network
      render json: @show, status: 201, notice: 'Show was successfully created.'
    else
      @networks = Network.all

SELECT  "shows".* FROM "shows" WHERE "shows"."slug" = ? LIMIT 1  [["slug", "a-great-show"]]
DELETE FROM "shows" WHERE "shows"."id" = ?  [["id", 1]]
---
  def destroy
    @show = Show.find_by(slug:params[:id])
    if current_user.admin?
      @show.destroy

SELECT  "users".* FROM "users" WHERE "users"."slug" = ? LIMIT 1  [["slug", "jason-paul-southwell"]]
SELECT  "shows".* FROM "shows" WHERE "shows"."slug" = ? LIMIT 1  [["slug", "another-interesting-show"]]
DELETE FROM "user_shows" WHERE "user_shows"."user_id" = ? AND "user_shows"."show_id" = 11  [["user_id", 4]]
---
  def remove_from_user_shows
    @user = User.find_by(slug:params[:user_id])
    show = Show.find_by(slug:params[:show_id])
    if @user == current_user
      @user.shows.delete(show)

SELECT  "shows".* FROM "shows" WHERE "shows"."slug" = ? LIMIT 1  [["slug", "a-great-show"]]
INSERT INTO "user_shows" ("user_id", "show_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["show_id", 1], ["created_at", "2016-06-06 20:37:19.942891"], ["updated_at", "2016-06-06 20:37:19.942891"]]
---
  def add_to_user_shows
    show = Show.find_by(slug:params[:show_id])
    if user_signed_in?
      current_user.shows << show