app/controllers/users_controller.rb

  def show
    @user = User.find_by(slug:params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."slug" = ? LIMIT 1  [["slug", "jason"]]