app/views/shows/index.html.erb

<script type="text/javascript" charset="utf-8">
  $( document ).ready(function() {
      event.preventDefault();
      $(".show_index").hide();
      $.ajax({
        type: "GET",
        dataType: "json",
        url: "/shows",
        success: function(data){
          if (data.length > 0) {
            for (var i = 0; i < data.length; i++) {
              var showLocalLink = "/shows/" + data[i].slug;
              var networkLocalLink = "/networks/" + data[i].network.slug;
              var showThumbnail = data[i].url;
              $('.shows_index').append("<a href='" + showLocalLink + "'><h2>" + data[i].title+ "</h2></a>");
              $('.shows_index').append("<a href='" + showLocalLink + "'><img src='" + showThumbnail + "' class='thumbnail'></a>");
              $('.shows_index').append("<a href='" + networkLocalLink + "'><p>" + data[i].network.name + "</p></a>");
              $('.shows_index').append("<p> " + data[i].description + "</p>");
            }
          } else {
            $('.search-results').append("<h2>There were no shows matching your search. Please try again.</h2>");
          }
---
SELECT  "networks".* FROM "networks" WHERE "networks"."id" = ? LIMIT 1  [["id", 1]]