app/views/shows/show.html.erb

<table>
  <%@show.users.each do |user|%>
---
SELECT "users".* FROM "users" INNER JOIN "user_shows" ON "users"."id" = "user_shows"."user_id" WHERE "user_shows"."show_id" = ?  [["show_id", 15]]

    <%end%>
    <li><%=link_to "USER: Add to my shows.", user_show_add_to_user_shows_path(current_user.id, @show.slug), method: :post  if !current_user.shows.include?(@show)%></li>
---
SELECT  "shows".* FROM "shows" INNER JOIN "user_shows" ON "shows"."id" = "user_shows"."show_id" WHERE "user_shows"."user_id" = ? AND "shows"."id" = ? LIMIT 1  [["user_id", 4], ["id", 10]]
SELECT  1 AS one FROM "shows" INNER JOIN "user_shows" ON "shows"."id" = "user_shows"."show_id" WHERE "user_shows"."user_id" = ? AND "shows"."id" = ? LIMIT 1  [["user_id", 2], ["id", 1]]